spec/fixtures/invoice_paid_fixture.json

{
  "count": 1,
  "results": [
    {
      "key": "invoices",
      "id": "4585"
    }
  ],
  "invoices": {
    "4585": {
      "created_at": "2020-07-09T15:41:50-07:00",
      "updated_at": "2020-07-16T17:05:02-07:00",
      "invoice_date": "2020-07-09",
      "due_date": "2020-08-08",
      "status": "accepted payment",
      "title": "Invoice #00009",
      "user_invoice_number": 9,
      "user_invoice_title": "",
      "tax_rate": 10.0,
      "purchase_order": "",
      "project_code": "",
      "message": "",
      "draft": false,
      "payment_schedule": 30,
      "balance_in_cents": 147950,
      "currency": "USD",
      "currency_symbol": "$",
      "currency_base_unit": 100,
      "recipient_id": null,
      "user_id": "2545",
      "workspace_ids": [
        "53754"
      ],
      "id": "4585"
    }
  },
  "meta": {
    "count": 1,
    "page_count": 1,
    "page_number": 1,
    "page_size": 20
  },
  "workspaces": {
    "53754": {
      "title": "I am A PrOjEcT HuRr DUuRR",
      "account_id": 415,
      "archived": false,
      "description": "",
      "due_date": "",
      "effective_due_date": "",
      "start_date": "",
      "budgeted": true,
      "change_orders_enabled": false,
      "updated_at": "2020-07-16T17:05:02-07:00",
      "created_at": "2020-01-30T11:42:13-08:00",
      "consultant_role_name": "Consultants",
      "client_role_name": "Clients",
      "percentage_complete": 0,
      "access_level": "admins",
      "exclude_archived_stories_percent_complete": false,
      "show_nonbillable_time_on_invoices": true,
      "can_create_line_items": true,
      "default_rate": "200.00",
      "currency": "USD",
      "currency_symbol": "$",
      "currency_base_unit": 100,
      "can_invite": true,
      "has_budget_access": true,
      "tasks_default_non_billable": false,
      "rate_card_id": 331,
      "workspace_invoice_preference_id": null,
      "posts_require_privacy_decision": false,
      "require_time_approvals": true,
      "require_expense_approvals": false,
      "has_active_timesheet_submissions": false,
      "has_active_expense_report_submissions": false,
      "status": {
        "color": "grey",
        "key": 100,
        "message": "Backlog"
      },
      "update_whitelist": [
        "title",
        "budgeted",
        "start_date",
        "due_date",
        "description",
        "currency",
        "access_level",
        "consultant_role_name",
        "client_role_name",
        "rate_card_id",
        "exclude_archived_stories_percent_complete",
        "tasks_default_non_billable",
        "stories_are_fixed_fee_by_default",
        "expenses_in_burn_rate",
        "posts_require_privacy_decision",
        "status_key",
        "invoice_preference",
        "approver_id",
        "approver_ids",
        "workspace_group_ids",
        "project_template_start_date",
        "project_template_assignment_mappings",
        "project_template_weekends_as_workdays",
        "project_template_create_unnamed_resources",
        "project_tracker_template_id",
        "target_margin",
        "external_reference",
        "account_color_id",
        "show_nonbillable_time_on_invoices",
        "archived",
        "price",
        "project_template_before_story_id",
        "change_orders_enabled"
      ],
      "account_features": {
        "time_trackable": false,
        "has_time_entry_role_picker": true,
        "project_side_panel": true
      },
      "permissions": {
        "can_upload_files": true,
        "can_private_message": true,
        "can_join": false,
        "is_participant": true,
        "access_level": "admin",
        "team_lead": true,
        "user_is_client": false,
        "can_change_price": true,
        "can_change_story_billable": true,
        "can_post": true,
        "can_edit": true,
        "restricted": false,
        "can_see_financials": true,
        "is_guest_on_project": false
      },
      "over_budget": false,
      "expenses_in_burn_rate": true,
      "total_expenses_in_cents": 0,
      "price_in_cents": null,
      "price": "TBD",
      "percent_of_budget_used": 0,
      "budget_used": "$17,103",
      "budget_used_in_cents": 1710300,
      "budget_remaining": null,
      "target_margin": null,
      "stories_are_fixed_fee_by_default": false,
      "creator_id": "2545",
      "primary_maven_id": "2545",
      "id": "53754"
    }
  }
}